In [7]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [14]:
df.groupby('sex').mean('total_bill', 'tip', 'size')

        total_bill       tip      size
sex
Male     20.744076  3.089618  2.630573
Female   18.056897  2.833448  2.459770

In [17]:
df.groupby('sex')['tip'].mean() # Retorna um pandas.Series []

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [18]:
df.groupby('sex')[['tip']].mean() # Retorna um pandas.DataFrame [[]]

             tip
sex
Male    3.089618
Female  2.833448

In [20]:
df.groupby(['time', 'day'])[['total_bill', 'tip']].mean()

             total_bill       tip
time   day
Lunch  Thur   17.664754  2.767705
       Fri    12.845714  2.382857
       Sat          NaN       NaN
       Sun          NaN       NaN
Dinner Thur   18.780000  3.000000
       Fri    19.663333  2.940000
       Sat    20.441379  2.993103
       Sun    21.410000  3.255132

In [23]:
import numpy as np

def mean_plus_10(values):
  return np.mean(values) + 10

df.groupby('smoker')[['tip']].agg(['min', 'max', 'mean', 'std', mean_plus_10, lambda x: x.mean()+10]) # A função 'agg' permite passar múltiplas funções de agregação

        tip
        min   max      mean       std mean_plus_10 <lambda_0>
smoker
Yes     1.0  10.0  3.008710  1.401468    13.008710  13.008710
No      1.0   9.0  2.991854  1.377190    12.991854  12.991854

In [26]:
def mean_diff(subdf):
  return np.mean(subdf['tip'] / subdf['total_bill'])

df.groupby('sex').apply(mean_diff) # Nota-se que o sexo feminino contribuiu mais em gorjeta proporcionalmente ao gasto na conta total, mas não em números absolutos

sex
Male      0.157651
Female    0.166491
dtype: float64